[
  {
    "url": "https://community.nintex.com//t5/Technical-Issues/Office-365-Update-Item-Permissions-return-unusable-List-item-URL/ta-p/90251",
    "q": "Office 365 Update Item Permissions return unusable... - Nintex Community\n            \n                \n                    \n                        Office 365 Update Item Permissions return unusable List item URL format\n                    \n                    \n                \n            \n        ",
    "a": ""
  },
  {
    "url": "https://community.nintex.com//t5/Release-Notes/Nintex-Forms-for-Office-365-Release-Notes/ta-p/87909",
    "q": "Nintex Forms for Office 365 - Release Notes - Nintex Community\n            \n                \n                    \n                        Nintex Forms for Office 365 - Release Notes\n                    \n                    \n                \n            \n        ",
    "a": "The release history outlines the key feature changes in the Nintex Forms for Office 365 service. It is not an exhaustive list of enhancements or bug fixes. 28th February 2019Note: This version supports English and Japanese.  Important information Improvements Fixes App Updates  24th January 2019Note: This version supports English and Japanese.  Important information Bug fixesFixed an issue where the People control may not allow scrolling (227650)Fixed an issue where Nintex Forms may show an error when submitting a form using iPad Safari browser (00232747; 00242907)Fixed an issue where a form may be slow when using multiple People picker controls (00217043)Fixed an issue where the Rich Text insert link with mailto: may not work correctly (00244480)Fixed an issue where the People picker control dropdown list may not render correctly (00247378; 00246687; 00227650) 13th December 2018Note: This version supports English and Japanese.  Important information Bug fixesPrint to PDF does not display image from root site (00211606; 00231617; 00239014; 00243030)Cascading lookup options are not alphabetized in the Mobile APIs (00238698)Viewing an attachment navigates away from form 29th November 2018Note: This version supports English and Japanese.  Important information Bug fixesFixed a font scaling issues when using themes for the Choice control in multiple-selection mode (checkbox or list). (00196534; 00211365)Fixed an issue where under certain conditions the internal name of a column changes when applied to a list. The symptom would be a control would appear bound when it was in fact not bound. This would normally occur when the column internal name includes non-ascii characters or the column name exceeds 64 characters. (00202095; 00215098) Fixed an issue where a rule inside a repeating section may cause the people picker control to change the height to 0 (00217378)Fixed an issue where a rule using isNullOrEmpty(Field) may not execute on a Multiline text box in view mode (00222194)Fixed an issue where isNullOrEmpty() runtime function may not work correctly in view mode for a panel in repeating section (00231888)Fixed an issue where the Task Form designer may not load after deleting a non-default content type (00233280)Fixed an issue where an attachment control may not allow access to view files in read-only mode 25th October 2018Note: This version supports English and Japanese.  Important information Feature Bug fixesResolved an issue when printing a form to PDF that contains more than 4 MB of data (i.e. images). We have increased the maximum size for a form to print to PDF from 4 MB to 50 MB. (00211726;00207644) 24th September 2018Note: This version supports English and Japanese.  Important information Bug fixesFixed an issue where Nintex Mobile would not be able to sign into an O365 account due to unsupported regional/language settings between the device and the server. Forms will now default to en-US when an unsupported regional/language settings is passed to the server (00232249) 19th September 2018Note: This version supports English and Japanese.  Important information Bug fixesFixed an issue where the \"By a specific value\" setting for the List Lookup control may not work for Nintex Mobile (225510)Fixed an issue where the Multiline textbox may not show an image in view and edit mode (00186536; 00145358,00196817; 00225396; 00228473; 00230308; 140742)Fixed an issue where the Multiline textbox with rich text enabled may not be disabled within the control settings (210590)Fixed an issue where the Multiline textbox may lose bottom edge of border when in new or edit mode (202387)Fixed an issue where a long word may go outside the border of a multiline textbox (203824)Fixed an issue where the Multiline textbox with rich text enabled may not allow images to be added in Chrome (00156270; 00157441)Fixed an issue where a repeating section with a multiline textbox may display an error (00187651; 00187589)Fixed an issue where the Attachments control name may remain blank after setting the name in a responsive form (200140; 00188862; 00193616; 00234263; 228061) 16th August 2018Note: This version supports English and Japanese.  Important information Bug fixesImprove compatibility with browsers that have ‘Prevent Cross-Site Tracking’ enabled (00195220; 00188483; 00191751; 00213732)Added a link 'Allow Application Access to User Profiles' to the Nintex Forms app page (00208158; 00205421; 00207890; 00207441; 00205421; 00214080)Fixed an issue where a calculated date value in a Repeating section may display an error (00211812)Fixed an issue where the Geolocation control may not work in Chrome (00220411) 18th June 2018Note: This version supports English and Japanese.  Important information Enhancements Bug fixesFixed an issue where a Lookup control with a Repeating Section in a Responsive Form may apply incorrect filters (00215611; 00212571; 00211248; 00221212; 00211135, 00217916, 00207225) 2nd May 2018Note: This version supports English and Japanese.  Important information Bug fixesFixed an issue where managed metadata control may not resolve entries during edit (00200904; 00202162)Fixed an issue where disabled reusable term sets may have caused some validation errors (00205479)Fixed an issue where a mobile form may have not been accessible due to data time formula (00202450)Fixed an issue where a form may have been caused due to special characters in inline function (00204144)Fixed an issue where the Page viewer may be affected by a disabled rule (00189247)27th March 2018Note: This version supports English and Japanese.  Important information Enhancements Bug fixes 17th January 2018Note: This version supports English and Japanese.  Important information Enhancements Bug fixes 22nd November 2017Note: This version supports English and Japanese.  Important information Enhancements Bug fixes 27th October 2017Note: This version supports English and Japanese.  Important information Bug fixes 19th October 2017Note: This version supports English and Japanese.  Important information Bug fixes Enhancements 18th September 2017Note: This version supports English and Japanese.  Important information Enhancements Bug fixes  21st August 2017Note: This version supports English and Japanese Important information Features 26th April 2017Note: This version supports English and Japanese Important information Features Bug fixes    This version includes Mobile phone browser device layout support: optimize forms for mobile phone browsers and view these on mobile devices.Performance improvements       "
  },
  {
    "url": "https://community.nintex.com//t5/Best-Practices/Nintex-Workflow-Office-365-Best-Practices/ta-p/85923",
    "q": "Nintex Workflow Office 365 Best Practices - Nintex Community\n            \n                \n                    \n                        Nintex Workflow Office 365 Best Practices\n                    \n                    \n                \n            \n        ",
    "a": "There are several areas to take note of when building workflows with Nintex for Office 365: Nintex recommends keeping the number of actions within a workflow design in Office 365 between 100 and 150 actions. While business processes can range from simple notifications to complex ETL processes, there are some guidelines around workflow size that you will want to follow:To better understand the true overall size of the workflow definition you can decompress the NWF file via the steps below: While the SharePoint on-premises versions of Nintex Workflow continue to utilize the Legacy Workflow Infrastructure, workflows designed with Nintex for Office 365 now use the Workflow Manager system (also known as the SharePoint 2013 Workflow Engine). Things to be aware of with Workflow Manager: One of the most prevalent issues caused by poor workflow design within SharePoint Online is workflow throttling. Below are some of the causes of workflow throttling, and ways to avoid throttling events. Best practices to avoid throttling In order to bring additional functionality to the SharePoint Online workflow platform, Nintex has leveraged our Nintex Live service to help extend the available actions within our workflows that are running within SharePoint Online.  Actions that utilize Nintex Live The actions below also use Nintex Live, but are acquired through the Nintex Store inside of the designer:The actions that work with Nintex Live bring incredible extensibility to the workflows that can be designed within Office 365. Here are a couple points to remember when using the Live actions:  "
  },
  {
    "url": "https://community.nintex.com//t5/Technical-Issues/Error-quot-Unable-to-reach-destination-server-quot-for-Office/ta-p/86659",
    "q": "Error \"Unable to reach destination server.\" for Of... - Nintex Community\n            \n                \n                    \n                        Error \"Unable to reach destination server.\" for Office 365 update item permissions using connection manager\n                    \n                    \n                \n            \n        ",
    "a": ""
  },
  {
    "url": "https://community.nintex.com//t5/Technical-Issues/Error-quot-Unable-to-find-list-item-to-update-quot-using-Office/ta-p/87083",
    "q": "Error \"Unable to find list item to update\" using O... - Nintex Community\n            \n                \n                    \n                        Error \"Unable to find list item to update\" using Office 365 update item permissions\n                    \n                    \n                \n            \n        ",
    "a": ""
  },
  {
    "url": "https://community.nintex.com//t5/Nintex-for-Office-365/Update-item-permissions-on-a-new-document/m-p/69953#M9438",
    "q": "Solved: Update item permissions on a new document - Nintex Community\nHi, I want to change the permissions on a new item so that when it is submitted the creator is no longer able to edit it. I'm using the \"Office 365 Update item permissions\" action.I tried using the current item's ID as the filter. However, I kept getting the error \"Filter rule error, column '26' does not exist. It may have been deleted by another user.\" - I think because the item doesn't really exist, and doesn't have an ID, until the workflow finishes.So I tried using other data as the filter - the unique reference number generated earlier in the same workflow, but I have the same issue.Can anyone help?I've included some screenshots of the action in case it helps.Many thanks.\n\t\t\t\t\t\n\t\t\t\t\t\tSolved!\n\t\t\t\t\t\n\t\t\t\t\tGo to Solution.\n\t\t\t\t",
    "a": "This is because you misused the \"Filter\" (your screen : update2.png).In the Filter element : You must write the column (in which you want to filter) and in the second you must write values (here you can refer to your item value)like this : "
  },
  {
    "url": "https://community.nintex.com//t5/Technical-Issues/Workflow-stuck-with-error-quot-Failed-to-resolve-group-quot-in/ta-p/89943",
    "q": "Workflow stuck with error \"Failed to resolve group... - Nintex Community\n            \n                \n                    \n                        Workflow stuck with error \"Failed to resolve group\" in Office 365 update item permissions\n                    \n                    \n                \n            \n        ",
    "a": ""
  },
  {
    "url": "https://community.nintex.com//t5/Nintex-for-Office-365/Issue-with-Office-365-Update-Item-Permissions-Action/m-p/89138#M10566",
    "q": "Solved: Issue with Office 365 Update Item Permissions-Acti... - Nintex Community\nI've created a simple Nintex workflow with one action to update item permissions.  See attachments below.  It keeps returning the error, 'the username format is invalid'.  Under User or Group Name in the configuration I've both tried to key in a Display Name, email address and Sharepoint group but with the same results.  On the same list item I've created Sharepoint 2010 workflow to update item permissions, and it runs with a successful result.  Any ideas what's causing the error? SP 2010 Workflow to update item permissions   Nintex worfklowUpdate item permissions-action config 2Update Item Permissions-action config 1\n\t\t\t\t\t\n\t\t\t\t\t\tSolved!\n\t\t\t\t\t\n\t\t\t\t\tGo to Solution.\n\t\t\t\t",
    "a": "The issue was resolved by reviewing the account used within the Connection Manager.The account used was in the following format username@domain.sharepoint.com or using MFA authentication. After creating a new service account in the following format username@domain.onmicrosoft.com the workflow completed as expected. Reviewing the following knowledge based article helped resolve the issue.Office 365 Actions Fail With Error: 'The Username Is Invalid Or Does Not Exist'"
  },
  {
    "url": "https://community.nintex.com//t5/Nintex-for-Office-365/Office-365-Update-Item-Permissions-Group-name/m-p/33352#M4520",
    "q": "\n                        Office 365 Update Item Permissions - Group name\n                    Solved: Office 365 Update Item Permissions - Group name - Nintex Community\nHi,There seems to be an issue with the Office 365 Update Item Permissions action within Nintex Workflow for Office 365. Whenever Group is chosen instead of a user, the update fails when the SharePoint Group name is longer than a certain number of characters.Is there any documentation about the exact limit? Furthermore, would it be possible to refer to groups by id rather than their names?\n\t\t\t\t\t\n\t\t\t\t\t\tSolved!\n\t\t\t\t\t\n\t\t\t\t\tGo to Solution.\n\t\t\t\t",
    "a": "Tom, Not sure how you are selecting the group name.  I tried typing it in and it didn't work, however when I used a variable to ensure it selected it from AD within O365, it worked and modified permissions without an issue.  I would suggest based on that, using a variable to set the group name before the action and then call the variable in the action.Let me know if that helps. "
  },
  {
    "url": "https://community.nintex.com//t5/Nintex-for-Office-365/Office-365-update-item-permissions/m-p/35664#M4873",
    "q": "Solved: Office 365 update item permissions - Nintex Community\nHello Everyone,We are using Office 365 and Nintex workflow and trying to change item permissions when a request is submitted. For this i have used \"Office 365 update item permissions\" workflow action and keep on getting the following error.\"The destination site was unable to process request. The provided credentials might not have access to the site.\"Even i tried using the tenant admin account but no luck. I am sure this is not a permissions issue but something else.Please advice if anyone have faced this problem.\n\t\t\t\t\t\n\t\t\t\t\t\tSolved!\n\t\t\t\t\t\n\t\t\t\t\tGo to Solution.\n\t\t\t\t",
    "a": "Hello Ravi, I have tried to use that action also as I have used it in the on prem version successfully. What I found out is that the way Nintex passes the credentials is very insecure. So in our environment those 'Office 365' type of actions are unusable.Our SharePoint engineer stated that he is hoping Nintex will switch the method the credentials are passed to oAuth by end of this year. But of course it's in Nintex's court to do so.regardsSteve"
  }
]
